Repository: YUYHY/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/how-to-getting-started-with-estimator.po
Languages: pt_un

source: This page was generated from `docs/tutorials/how-to-getting-started-with-estimator.ipynb`__.
pt_un: Esta página foi gerada a partir de `docs/tutorials/how-to-getting-started-with-estimator.ipynb`__.

source: Get started with the Estimator primitive
pt_un: Começando com o primitivo Estimator

source: Learn how to set up and use the Estimator primitive program.
pt_un: Aprenda como configurar e usar o programa primitivo Estimator.

source: Overview
pt_un: Visão geral

source: The Estimator primitive lets you efficiently calculate and interpret expectation values of quantum operators required for many algorithms. You can specify a list of circuits and observables, then evaluate expectation values and variances for a given parameter input.
pt_un: O primitivo Estimator permite calcular e interpretar com eficiência os valores esperados dos operadores quânticos necessários para muitos algoritmos. Você pode especificar uma lista de circuitos e observáveis e, em seguida, avaliar os valores esperados e as variações para uma determinada entrada de parâmetro.

source: Prepare the environment
pt_un: Prepare o ambiente

source: Follow the steps in the `getting started guide <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ to get your quantum service instance ready to use.
pt_un: Siga as etapas no `guia de introdução <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ para preparar sua instância de serviço quântico para uso.

source: You’ll need at least one circuit to submit to the program. Our examples all have circuits in them, but if you want to submit your own circuit, you can use Qiskit to create one. To learn how to create circuits by using Qiskit, see the `Circuit basics tutorial <https://qiskit.org/documentation/tutorials/circuits/01_circuit_basics.html>`__.
pt_un: Você precisará de pelo menos um circuito para enviar ao programa. Todos os nossos exemplos têm circuitos, mas se você quiser enviar seu próprio circuito, você pode usar o Qiskit para criar um. Para aprender a criar circuitos usando o Qiskit, veja o `Tutorial básico de circuitos <https://qiskit.org/documentation/tutorials/circuits/01_circuit_basics.html>`__.

source: Create a list of observables. Observables let you define the properties of the circuit that are relevant to your problem and enable you to efficiently measure their expectation value. For simplicity, you can use the `PauliSumOp class <https://qiskit.org/documentation/stubs/qiskit.opflow.primitive_ops.html#module-qiskit.opflow.primitive_ops>`__ in Qiskit to define them, as illustrated in the example below.
pt_un: Crie uma lista de observáveis. Os observáveis permitem definir as propriedades do circuito que são relevantes para o seu problema e permitem medir com eficiência o valor esperado. Para simplificar, você pode usar a classe `PauliSumOp <https://qiskit.org/documentation/stubs/qiskit.opflow.primitive_ops.html#module-qiskit.opflow.primitive_ops>`__ no Qiskit para defini-los, conforme ilustrado em o exemplo abaixo.

source: Start a session
pt_un: Inicie uma sessão

source: With Qiskit Runtime primitives, we introduce the concept of a session or a factory that allows you to define a job as a collection of iterative calls to the quantum computer. When you start a session, it caches the data you send so it doesn’t have to be transmitted to the Quantum Datacenter on each iteration.
pt_un: Com os primitivos do Qiskit Runtime, apresentamos o conceito de uma sessão ou uma fábrica que permite definir um trabalho como uma coleção de chamadas iterativas para o computador quântico. Quando você inicia uma sessão, ele armazena em cache os dados enviados para que não precisem ser transmitidos ao Quantum Datacenter em cada iteração.

source: Specify program inputs
pt_un: Especifique as entradas do programa

source: The Estimator takes in the following arguments:
pt_un: O Estimator aceita os seguintes argumentos:

source: **circuits**: a list of (parameterized) circuits that you want to investigate.
pt_un: **circuits**: uma lista de circuitos (parametrizados) que você deseja investigar.

source: **observables**: a list of observables to measure the expectation values.
pt_un: **observables**: uma lista de observáveis para medir os valores esperados.

source: **parameters**: a list of parameters for the parameterized circuits. It should be omitted if the circuits provided are not parameterized.
pt_un: **parâmeters**: uma lista de parâmetros para os circuitos parametrizados. Deve ser omitido se os circuitos fornecidos não estiverem parametrizados.

source: **skip_transpilation**: circuit transpilation is skipped if set to ``True``. Default value is ``False``.
pt_un: **skip_transpilation**: a transpilação do circuito é ignorada se definida como ``True``. O valor padrão é ``False``.

source: **service**: the ``QiskitRuntimeService`` instance to run the program on. If not specified, the default saved account for ``QiskitRuntimeService`` is initialized.
pt_un: **service**: a instância ``QiskitRuntimeService`` para executar o programa. Se não for especificado, a conta salva padrão em ``QiskitRuntimeService`` será inicializada.

source: **options**: Runtime options dictionary that control the execution environment.
pt_un: **options**: Dicionário de opções de runtime que controla o ambiente de execução.

source: **backend**: The backend to run on. This option is required if you are running on `IBM Quantum <https://quantum-computing.ibm.com/>`__. However, if you are running on `IBM Cloud <https://cloud.ibm.com/quantum>`__, you can choose not to specify the backend, in which case the least busy backend is used.
pt_un: **back-end**: o backend a ser executado. Esta opção é necessária se estivermos executando no `IBM Quantum <https://quantum-computing.ibm.com/>`__. No entanto, se estivermos executando no `IBM Cloud <https://cloud.ibm.com/quantum>`__, poderá optar por não especificar o backend, assim o backend menos ocupado será usado.

source: You can find more details in `the Estimator API reference <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.Estimator.html>`__.
pt_un: Você pode encontrar mais detalhes na `referência de API do Estimator <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.Estimator.html>`__.

source: Example:
pt_un: Exemplo:

source: Write to & read from a session
pt_un: Gravar e ler de uma sessão

source: Running a job and returning the results are done by writing to and reading from the session. After the results are returned, the session is automatically closed.
pt_un: A execução de um job e o retorno dos resultados são feitos gravando e lendo da sessão. Depois que os resultados são retornados, a sessão é fechada automaticamente.

source: Run the job & print results
pt_un: Execute o job & impirima os resultados

source: Run the job, specifying your previously defined inputs and options. Use ``circuits``, ``observables``, and ``parameter_values`` to use a specific parameter and observable with the specified circuit.
pt_un: Execute o job, especificando suas entradas e opções definidas anteriormente. Use ``circuits``, ``observables`` e ``parameter_values`` para usar um parâmetro específico e observável com o circuito especificado.

source: For example, this line ``psi1_H23_result = estimator(circuits=[0, 0], observables=[1, 2], parameter_values=[theta1]*2)`` specifies the following:
pt_un: Por exemplo, esta linha ``psi1_H23_result = estimator(circuits=[0, 0], observables=[1, 2], parameter_values=[theta1]*2)`` especifica o seguinte:

source: Return the value for using observable ``H2`` and parameter ``theta1`` with the circuit ``psi1``.
pt_un: Retorna o valor para usar o observável ``H2`` e o parâmetro ``theta1`` com o circuito ``psi1``.

source: Return the value for using observable ``H3`` and parameter ``theta1`` with the circuit ``psi1``.
pt_un: Retorna o valor para usar o observável ``H3`` e o parâmetro ``theta1`` com o circuito ``psi1``.

source: You can also pass circuits and observables as objects. For example, ``psi1_H23_result = estimator(circuits=[ps1, ps1], observables=[H2, H3], parameter_values=[theta1]*2)``
pt_un: Você também pode passar circuitos e observáveis como objetos. Por exemplo, ``psi1_H23_result = estimator(circuits=[ps1, ps1], observables=[H2, H3], parameter_values=[theta1]*2)``

source: The results align with the parameter - circuit - observable tuples specified previously. For example, the first result: ``EstimatorResult(values=array([1.55273438]), metadata=[{'variance': 8.897655487060547, 'shots': 1024}])`` is the output of the parameter labeled ``theta1`` and observable ``H1`` being sent to the first circuit.
pt_un: Os resultados se alinham com o parâmetro - circuit - tuplas observáveis especificadas anteriormente. Por exemplo, o primeiro resultado: ``EstimatorResult(values=array([1.55273438]), metadata=[{'variance': 8.897655487060547, 'shots': 1024}])`` é a saída do parâmetro rotulado ``theta1 `` e observável ``H1`` sendo enviado para o primeiro circuito.
