Repository: YUYHY/qiskit-translations
Catalog: qiskit-ibm-runtime/docs/locale/*/LC_MESSAGES/tutorials/how-to-getting-started-with-sampler.po
Languages: pt_un

source: This page was generated from `docs/tutorials/how-to-getting-started-with-sampler.ipynb`__.
pt_un: Esta página foi gerada a partir de `docs/tutorials/how-to-getting-started-with-sampler.ipynb`__.

source: Get started with the Sampler primitive
pt_un: Começando com o primitivo Sampler

source: Learn how to set up and use the Sampler primitive program.
pt_un: Aprenda como configurar e usar o programa primitivo Sampler.

source: Overview
pt_un: Visão geral

source: The Sampler primitive lets you more accurately contextualize counts. It takes a user circuit as an input and generates an error-mitigated readout of quasiprobabilities. This enables you to more efficiently evaluate the possibility of multiple relevant data points in the context of destructive interference.
pt_un: O primitivo Sampler permite contextualizar as contagens com mais precisão. Ele recebe um circuito de um usuário como entrada e gera uma leitura de quase-probabilidades com mitigação de erros. Isso permite avaliar com mais eficiência a possibilidade de vários pontos de dados relevantes no contexto de interferência destrutiva.

source: Prepare the environment
pt_un: Prepare o ambiente

source: Follow the steps in the `getting started guide <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ to get your Quantum Service instance ready to use.
pt_un: Siga as etapas no `guia de introdução <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/getting_started.html>`__ para preparar sua instância de serviço quântico para uso.

source: You’ll need at least one circuit to submit to the program. Our examples all have circuits in them, but if you want to submit your own circuit, you can use Qiskit to create one. To learn how to create circuits by using Qiskit, see the `Circuit basics tutorial <https://qiskit.org/documentation/tutorials/circuits/01_circuit_basics.html>`__.
pt_un: Você precisará de pelo menos um circuito para enviar ao programa. Todos os nossos exemplos têm circuitos, mas se você quiser enviar seu próprio circuito, você pode usar o Qiskit para criar um. Para aprender a criar circuitos usando o Qiskit, veja o `Tutorial básico de circuitos <https://qiskit.org/documentation/tutorials/circuits/01_circuit_basics.html>`__.

source: Start a session
pt_un: Inicie uma sessão

source: With Qiskit Runtime primitives, we introduce the concept of a session or a factory that allows you to define a job as a collection of iterative calls to the quantum computer. When you start a session, it caches the data you send so it doesn’t have to be transmitted to the Quantum Datacenter on each iteration.
pt_un: Com os primitivos do Qiskit Runtime, apresentamos o conceito de uma sessão ou uma fábrica que permite definir um trabalho como uma coleção de chamadas iterativas para o computador quântico. Quando você inicia uma sessão, ele armazena em cache os dados enviados para que não precisem ser transmitidos ao Quantum Datacenter em cada iteração.

source: Specify program inputs
pt_un: Especifique as entradas do programa

source: The Sampler takes in the following arguments:
pt_un: O Smapler aceita os seguintes argumentos:

source: **circuits**: a list of (parameterized) circuits that you want to investigate.
pt_un: **circuits**: uma lista de circuitos (parametrizados) que você deseja investigar.

source: **parameters**: a list of parameters for the parameterized circuits. It should be omitted if the circuits provided are not parameterized.
pt_un: **parameters**: uma lista de parâmetros para os circuitos parametrizados. Deve ser omitido se os circuitos fornecidos não estiverem parametrizados.

source: **skip_transpilation**: circuit transpilation is skipped if set to ``True``. Default value is ``False``.
pt_un: **skip_transpilation**: a transpilação do circuito é ignorada se definida como ``True``. O valor padrão é ``False``.

source: **service**: the ``QiskitRuntimeService`` instance to run the program on. If not specified, the default saved account for ``QiskitRuntimeService`` is initialized.
pt_un: **service**: a instância ``QiskitRuntimeService`` para executar o programa. Se não for especificado, a conta salva padrão em ``QiskitRuntimeService`` será inicializada.

source: **options**: Runtime options dictionary that control the execution environment.
pt_un: **options**: Dicionário de opções de runtime que controla o ambiente de execução.

source: **backend**: The backend to run on. This option is required if you are running on `IBM Quantum <https://quantum-computing.ibm.com/>`__. However, if you are running on `IBM Cloud <https://cloud.ibm.com/quantum>`__, you can choose not to specify the backend, in which case the least busy backend is used.
pt_un: **back-end**: o backend a ser executado. Esta opção é necessária se estivermos executando no `IBM Quantum <https://quantum-computing.ibm.com/>`__. No entanto, se estivermos executando no `IBM Cloud <https://cloud.ibm.com/quantum>`__, poderá optar por não especificar o backend, assim o backend menos ocupado será usado.

source: You can find more details in `the Sampler API reference <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.Sampler.html>`__.
pt_un: Você pode encontrar mais detalhes na `referência de API do Sampler <https://qiskit.org/documentation/partners/qiskit_ibm_runtime/stubs/qiskit_ibm_runtime.Sampler.html>`__.

source: Example:
pt_un: Exemplo:

source: Write to & read from a session
pt_un: Gravar e ler de uma sessão

source: Running a job and returning the results are done by writing to and reading from the session. The session closes when the code exits the ``with`` block.
pt_un: A execução de um job e o retorno dos resultados são feitos gravando e lendo da sessão. A sessão fecha quando o código sai do bloco ``with``.

source: Run the job & print results
pt_un: Execute o job & imprima os resultados

source: Run the job, specifying your previously defined inputs and options. In this simple example, there is only one circuit and it does not have parameters.
pt_un: Execute o job, especificando suas entradas e opções definidas anteriormente. Neste exemplo simples, há apenas um circuito e não possui parâmetros.

source: In each call, you will use ``circuits`` to specify which circuit to run and, if applicable, ``parameter_values`` specifies which parameter to use with the specified circuit.
pt_un: Em cada chamada, você usará ``circuits`` para especificar qual circuito executar e, se aplicável, ``parameter_values`` especifica qual parâmetro usar com o circuito especificado.

source: In this example, we specified one circuit, ``circuits=bell``, and we asked for the result for running the first (and only) circuit: ``circuits=[0]``.
pt_un: Neste exemplo, especificamos um circuito, ``circuits=bell``, e pedimos o resultado para executar o primeiro (e único) circuito: ``circuits=[0]``.

source: As you will see in later examples, if we had specified multiple circuits, such as ``circuits=[pqc, pqc2]`` when initializing the session, you could specify ``circuits=[1]`` or ``circuits=[pqc2]`` in each call to run the ``pqc2`` circuit.
pt_un: Como você verá em exemplos posteriores, se tivéssemos especificado vários circuitos, como ``circuits=[pqc, pqc2]`` ao inicializar a sessão, você poderia especificar ``circuits=[1]`` ou ``circuits= [pqc2]`` em cada chamada para executar o circuito ``pqc2``.

source: Multiple circuit example
pt_un: Exemplo com múltiplos circuitos

source: In this example, we specify three circuits, but they have no parameters:
pt_un: Neste exemplo, especificamos três circuitos, mas eles não possuem parâmetros:

source: Multiple parameterized circuits example
pt_un: Exemplo de vários circuitos parametrizados

source: In this example, we run multiple parameterized circuits. When it is run, this line ``result = sampler(circuits=[0, 0, 1], parameter_values=[theta1, theta2, theta3])`` specifies which parameter to send to each circuit.
pt_un: Neste exemplo, executamos vários circuitos parametrizados. Quando executada, esta linha ``result = sampler(circuits=[0, 0, 1], parameter_values=[theta1, theta2, theta3])`` especifica qual parâmetro enviar para cada circuito.

source: In our example, the parameter labeled ``theta1`` is sent to the first circuit, ``theta2`` is sent to the first circuit, and ``theta3`` is sent to the second circuit.
pt_un: Em nosso exemplo, o parâmetro chamado ``theta1`` é enviado para o primeiro circuito, ``theta2`` é enviado para o segundo circuito e ``theta3`` é enviado para o terceiro circuito.

source: Result
pt_un: Resultado

source: The results align with the parameter - circuit pairs specified previously. For example, the first result (``{'11': 0.42578125, '00': 0.14453125, '10': 0.0888671875, '01': 0.3408203125}``) is the output of the parameter labeled ``theta1`` being sent to the first circuit.
pt_un: Os resultados se alinham com os pares parâmetro - circuito especificados anteriormente. Por exemplo, o primeiro resultado (``{'11': 0.42578125, '00': 0.14453125, '10': 0.0888671875, '01': 0.3408203125}``) é a saída do parâmetro rotulado como ``theta1`` sendo enviado para o primeiro circuito.
